rowdy15/battery-powered-ble-irrigation-controller-project-with-the-nRF52832/main.c
APP_TIMER_DEF(m_our_char_timer_id);
APP_TIMER_DEF(m_battery_timer_id);                                                /**< Battery measurement timer. */
APP_TIMER_DEF(m_battery_frequency_id);                                                /**< Battery measurement timer. */
//APP_TIMER_DEF(m_notification_timer_id);
NRF_BLE_GATT_DEF(m_gatt);                                                         /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                           /**< Context for the Queued Write module.*/
BLE_BAS_DEF(m_bas);                                                               /**< Battery service instance. */
BLE_ADVERTISING_DEF(m_advertising);                                               /**< Advertising module instance. */
BLE_CUS_DEF(m_cus);                                                               /**< Context for the Queued Write module.*/
BLE_OPT_DEF(m_opt);                                                               /**< Context for the Queued Write module.*/

static uint16_t           m_conn_handle = BLE_CONN_HANDLE_INVALID;                          /**< Handle of the current connection. */
static pm_peer_id_t       m_peer_id;                                               /**< Device reference handle to the current bonded central. */
static bool               m_in_boot_mode = false;                                  /**< Current protocol mode. */
static uint8_t            m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;                     /**< Advertising handle used to identify an advertising set. */
static uint8_t            m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];                      /**< Buffer for storing an encoded advertising set. */
static uint8_t            m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];           /**< Buffer for storing an encoded scan data. */
static uint16_t           battery_level_measure_interval_counter = 0;
static uint16_t           battery_measure_interval = 5;  // 1 hour is the default 

static uint16_t           m_battery_conn_handle = BLE_CONN_HANDLE_INVALID;

static nrf_saadc_value_t adc_buf[2];
static uint32_t watering_duration =  0;                                      
//static uint8_t m_custom_value = 0;
static uint8_t pm_paired = 0;
//Step 5: Declare variable holding our service UUID
static ble_uuid_t m_adv_uuids[] = {{CUSTOM_SERVICE_UUID,BLE_UUID_TYPE_VENDOR_BEGIN}};

static void advertising_start(bool erase_bonds);
static void on_bas_evt(ble_bas_t * p_bas, ble_bas_evt_t * p_evt);




/**@brief Handler for shutdown preparation.
 *
 * @details During shutdown procedures, this function will be called at a 1 second interval
 *          untill the function returns true. When the function returns true, it means that the
 *          app is ready to reset to DFU mode.
 *
 * @param[in]   event   Power manager event.
 *
 * @retval  True if shutdown is allowed by this power manager handler, otherwise false.
 */
static bool app_shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
    switch (event)
    {
        case NRF_PWR_MGMT_EVT_PREPARE_DFU:
            //SEGGER_RTT_WriteString(0,"Power management wants to reset to DFU mode.");
            // YOUR_JOB: Get ready to reset into DFU mode
            //
            // If you aren't finished with any ongoing tasks, return "false" to
            // signal to the system that reset is impossible at this stage.
            //
            // Here is an example using a variable to delay resetting the device.
            //
            // if (!m_ready_for_reset)
            // {
            //      return false;
            // }
            // else
            //{
            //
            //    // Device ready to enter
            //    uint32_t err_code;
            //    err_code = sd_softdevice_disable();
            //    APP_ERROR_CHECK(err_code);
            //    err_code = app_timer_stop_all();
            //    APP_ERROR_CHECK(err_code);
            //}
            break;

        default:
            // YOUR_JOB: Implement any of the other events available from the power management module:
            //      -NRF_PWR_MGMT_EVT_PREPARE_SYSOFF
            //      -NRF_PWR_MGMT_EVT_PREPARE_WAKEUP
            //      -NRF_PWR_MGMT_EVT_PREPARE_RESET
            return true;
    }

    //SEGGER_RTT_WriteString(0,"Power management allowed to reset to DFU mode.");
    return true;
}

// lint -esym(528, m_app_shutdown_handler)
/**@brief Register application shutdown handler with priority 0.
 */
NRF_PWR_MGMT_HANDLER_REGISTER(app_shutdown_handler, 0);


static void buttonless_dfu_sdh_state_observer(nrf_sdh_state_evt_t state, void * p_context)
{
    if (state == NRF_SDH_EVT_STATE_DISABLED)
    {
        // Softdevice was disabled before going into reset. Inform bootloader to skip CRC on next boot.
        nrf_power_gpregret2_set(BOOTLOADER_DFU_SKIP_CRC);

        //Go to system off.
        nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
    }
}

/* nrf_sdh state observer. */
NRF_SDH_STATE_OBSERVER(m_buttonless_dfu_state_obs, 0) =
{
    .handler = buttonless_dfu_sdh_state_observer,
};


static void advertising_config_get(ble_adv_modes_config_t * p_config)
{
    memset(p_config, 0, sizeof(ble_adv_modes_config_t));

    p_config->ble_adv_fast_enabled  = true;
    p_config->ble_adv_fast_interval = APP_ADV_SLOW_INTERVAL;
    p_config->ble_adv_fast_timeout  = APP_ADV_SLOW_DURATION;
}


static void disconnect(uint16_t conn_handle, void * p_context)
{
    UNUSED_PARAMETER(p_context);

    ret_code_t err_code = sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (err_code != NRF_SUCCESS)
    {
        //NRF_LOG_WARNING("Failed to disconnect connection. Connection handle: %d Error: %d", conn_handle, err_code);
    }
    else
    {
        //NRF_LOG_DEBUG("Disconnected connection handle %d", conn_handle);
    }
}



// YOUR_JOB: Update this code if you want to do anything given a DFU event (optional).
/**@brief Function for handling dfu events from the Buttonless Secure DFU service
 *
 * @param[in]   event   Event from the Buttonless Secure DFU service.
 */
static void ble_dfu_evt_handler(ble_dfu_buttonless_evt_type_t event)
{
    switch (event)
    {
        case BLE_DFU_EVT_BOOTLOADER_ENTER_PREPARE:
        {
            //SEGGER_RTT_WriteString(0,"Device is preparing to enter bootloader mode.");

            // Prevent device from advertising on disconnect.
            ble_adv_modes_config_t config;
            advertising_config_get(&config);
            config.ble_adv_on_disconnect_disabled = true;
            ble_advertising_modes_config_set(&m_advertising, &config);

            // Disconnect all other bonded devices that currently are connected.
            // This is required to receive a service changed indication
            // on bootup after a successful (or aborted) Device Firmware Update.
            uint32_t conn_count = ble_conn_state_for_each_connected(disconnect, NULL);
            SEGGER_RTT_printf(0,"Disconnected %d links.", conn_count);
            //SEGGER_RTT_WriteString(0,"Disconnected %d links.", conn_count);
            break;
        }

        case BLE_DFU_EVT_BOOTLOADER_ENTER:
            // YOUR_JOB: Write app-specific unwritten data to FLASH, control finalization of this
            //           by delaying reset by reporting false in app_shutdown_handler
            SEGGER_RTT_WriteString(0,"Device will enter bootloader mode.");
            //SEGGER_RTT_WriteString(0,"Device will enter bootloader mode.");
            break;

        case BLE_DFU_EVT_BOOTLOADER_ENTER_FAILED:
            SEGGER_RTT_WriteString(0,"Request to enter bootloader mode failed asynchroneously.");
            //NRF_LOG_ERROR("Request to enter bootloader mode failed asynchroneously.");
            // YOUR_JOB: Take corrective measures to resolve the issue
            //           like calling APP_ERROR_CHECK to reset the device.
            break;

