rowdy15/battery-powered-ble-irrigation-controller-project-with-the-nRF52832/main.c
            err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL_5_MIN, NULL);
            APP_ERROR_CHECK(err_code);
            SEGGER_RTT_WriteString(0,"the battery service has been notify enabled\n");
            break; // BLE_BAS_EVT_NOTIFICATION_ENABLED

        case BLE_BAS_EVT_NOTIFICATION_DISABLED:
            SEGGER_RTT_WriteString(0,"the battery service has been notify disabled\n");
            err_code = app_timer_stop(m_battery_timer_id);
            APP_ERROR_CHECK(err_code);
            break; // BLE_BAS_EVT_NOTIFICATION_DISABLED

        default:
            // No implementation needed.
            break;
    }
}

/**@brief Function for handling the Custom Service Service events.
 *
 * @details This function will be called for all Custom Service events which are passed to
 *          the application.
 *
 * @param[in]   p_cus_service  Custom Service structure.
 * @param[in]   p_evt          Event received from the Custom Service.
 *
 */
static void on_cus_evt(ble_cus_t * p_cus_service, ble_cus_evt_t * p_evt)
{
    ret_code_t err_code;
    
    switch(p_evt->evt_type)
    {
        case BLE_CUS_EVT_NOTIFICATION_ENABLED:
            SEGGER_RTT_WriteString(0,"the custom service has been notify enabled\n");
            break;

        case BLE_CUS_EVT_NOTIFICATION_DISABLED:
            SEGGER_RTT_WriteString(0,"the custom service has been notify disabled\n");
            err_code = app_timer_stop(m_our_char_timer_id);
            APP_ERROR_CHECK(err_code);                        
            break;
        case BLE_CUS_BEGIN_TAP_TIMER:
              SEGGER_RTT_WriteString(0,"tap timer is on and counting down to zero.\n");
              err_code = app_timer_start(m_our_char_timer_id, CUSTOM_SERVICE_NOTIFICATION_INTERVAL, NULL);
              APP_ERROR_CHECK(err_code);
              break;
        case BLE_CUS_END_TAP_TIMER:
              SEGGER_RTT_WriteString(0,"Tap timer will stop now.\n");
              err_code = app_timer_stop(m_our_char_timer_id);
              APP_ERROR_CHECK(err_code); 
              break;
        case BLE_CUS_EVT_DISCONNECTED:
//            SEGGER_RTT_WriteString(0,"if tap timer is on then then this will turn it off on disconnection of esp32\n");
//            err_code = app_timer_stop(m_our_char_timer_id);
//            APP_ERROR_CHECK(err_code); 
              break;

        case BLE_CUS_EVT_CONNECTED:
            break;


        default:
              // No implementation needed.
              break;
    }
}

/**@brief Function for handling the Custom Service Service events.
 *
 * @details This function will be called for all Custom Service events which are passed to
 *          the application.
 *
 * @param[in]   p_cus_service  Custom Service structure.
 * @param[in]   p_evt          Event received from the Custom Service.
 *
 */
static void on_opt_evt(ble_option_t * p_opt_service, ble_opt_evt_t * p_evt)
{
    ret_code_t err_code;
    
    switch(p_evt->evt_type)
    {
        case BLE_OPT_BAT_CHECK_1_MIN:
            err_code = app_timer_stop(m_battery_timer_id);
            APP_ERROR_CHECK(err_code);
            battery_level_measure_interval_counter = 1; // the number of times that 5 mins is run
            err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL_5_MIN, NULL);
            APP_ERROR_CHECK(err_code);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 5 min!\n");
            break;
        case BLE_OPT_BAT_CHECK_10_MIN:
            err_code = app_timer_stop(m_battery_timer_id);
            APP_ERROR_CHECK(err_code);
            battery_level_measure_interval_counter = 2; // the number of times that 5 mins is run
            err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL_5_MIN, NULL);
            APP_ERROR_CHECK(err_code);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 10 min!\n");
            break;
        case BLE_OPT_BAT_CHECK_30_MIN:
            err_code = app_timer_stop(m_battery_timer_id);
            APP_ERROR_CHECK(err_code);
            battery_level_measure_interval_counter = 6; // the number of times that 5 mins is run
            err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL_5_MIN, NULL);
            APP_ERROR_CHECK(err_code);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 30 min!\n");
            break;
        case BLE_OPT_BAT_CHECK_1_HR:
            err_code = app_timer_stop(m_battery_timer_id);
            APP_ERROR_CHECK(err_code);
            battery_level_measure_interval_counter = 12; // the number of times that 5 mins is run
            err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL_5_MIN, NULL);
            APP_ERROR_CHECK(err_code);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 1 hour!\n");
            break;
            err_code = app_timer_stop(m_battery_timer_id);
            APP_ERROR_CHECK(err_code);
            battery_level_measure_interval_counter = 72; // the number of times that 5 mins is run
            err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL_5_MIN, NULL);
            APP_ERROR_CHECK(err_code);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 6 hours!\n");
            break;
        case BLE_OPT_BAT_CHECK_12_HR:
            err_code = app_timer_stop(m_battery_timer_id);
            APP_ERROR_CHECK(err_code);
            battery_level_measure_interval_counter = 144; // the number of times that 5 mins is run
            err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL_5_MIN, NULL);
            APP_ERROR_CHECK(err_code);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 12 hours!\n");
            break;
        case BLE_OPT_BAT_CHECK_24_HR:
            err_code = app_timer_stop(m_battery_timer_id);
            APP_ERROR_CHECK(err_code);
            battery_level_measure_interval_counter = 288; // the number of times that 5 mins is run
            err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL_5_MIN, NULL);
            APP_ERROR_CHECK(err_code);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 24 hours!\n");
            break;
        case BLE_OPT_EVT_CONNECTED:
            break;

        case BLE_OPT_EVT_DISCONNECTED:
              break;
        default:
              // No implementation needed.
              break;
    }
}





/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);

