rowdy15/battery-powered-ble-irrigation-controller-project-with-the-nRF52832/main.c
        ret_code_t ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(ret);
    }
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    ret_code_t err_code;

    switch (p_evt->evt_id)
        {
        case PM_EVT_BONDED_PEER_CONNECTED:
        {
            SEGGER_RTT_WriteString(0,"Connected to a previously bonded device.\n");
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
            SEGGER_RTT_printf(0,"Connection secured: role: %d, conn_handle: 0x%x, procedure: %d.\n",
                         ble_conn_state_role(p_evt->conn_handle),
                         p_evt->conn_handle,
                         p_evt->params.conn_sec_succeeded.procedure);
        } break;

        case PM_EVT_CONN_SEC_FAILED:
        {
        SEGGER_RTT_WriteString(0,"Failed to secure the connection.  Long Press Button to erase bonds.\n");
            /* Often, when securing fails, it shouldn't be restarted, for security reasons.
             * Other times, it can be restarted directly.
             * Sometimes it can be restarted, but only after changing some Security Parameters.
             * Sometimes, it cannot be restarted until the link is disconnected and reconnected.
             * Sometimes it is impossible, to secure the link, or the peer device does not support it.
             * How to handle this error is highly application dependent. */
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
            // Reject pairing request from an already bonded peer.
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        } break;

        case PM_EVT_STORAGE_FULL:
        {
        SEGGER_RTT_WriteString(0,"PM_EVT_STORAGE_FULL event storage is full.\n");
            // Run garbage collection on the flash.
            err_code = fds_gc();
            if (err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
            {
                // Retry.
            }
            else
            {
                APP_ERROR_CHECK(err_code);
            }
        } break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
        {
          SEGGER_RTT_WriteString(0,"PM_EVT_PEERS_DELETE_SUCCEEDED\n");
          //NVIC_SystemReset();
          //advertising_start(false);
        } break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_data_update_failed.error);
        } break;

        case PM_EVT_PEER_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
        } break;

        case PM_EVT_PEERS_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
        } break;

        case PM_EVT_ERROR_UNEXPECTED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
        } break;

        case PM_EVT_CONN_SEC_START:
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        case PM_EVT_PEER_DELETE_SUCCEEDED:
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
            // This can happen when the local DB has changed.
        case PM_EVT_SERVICE_CHANGED_IND_SENT:
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
        default:
            break;
    }

}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    ret_code_t err_code;

    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    ret_code_t err_code;

    switch (ble_adv_evt)
    {
        //case BLE_ADV_EVT_DIRECTED_HIGH_DUTY:
        //    SEGGER_RTT_WriteString(0,"Directed advertising.\n");
        //    err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_DIRECTED);
        //    APP_ERROR_CHECK(err_code);
        //    break;

//        case BLE_ADV_EVT_FAST:
//            SEGGER_RTT_WriteString(0,"Fast advertising.\n");
//            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
//            APP_ERROR_CHECK(err_code);
//            break;

//        case BLE_ADV_EVT_SLOW:
//            SEGGER_RTT_WriteString(0,"Slow advertising.\n");
//#if SWIFT_PAIR_SUPPORTED == 1
//            m_sp_advdata.p_manuf_specific_data = NULL;
//            err_code = ble_advertising_advdata_update(&m_advertising, &m_sp_advdata, NULL);
//            APP_ERROR_CHECK(err_code);
//#endif
//            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_SLOW);
//            APP_ERROR_CHECK(err_code);
//            break;

        //case BLE_ADV_EVT_FAST_WHITELIST:
        //    SEGGER_RTT_WriteString(0,"Fast advertising with whitelist.\n");
        //    err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_WHITELIST);
        //    APP_ERROR_CHECK(err_code);
        //    break;

        //case BLE_ADV_EVT_SLOW_WHITELIST:
        //    SEGGER_RTT_WriteString(0,"Slow advertising with whitelist.\n");
        //    err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_WHITELIST);
        //    //APP_ERROR_CHECK(err_code);
        //    //err_code = ble_advertising_restart_without_whitelist(&m_advertising);
        //    //APP_ERROR_CHECK(err_code);
        //    break;

