rowdy15/battery-powered-ble-irrigation-controller-project-with-the-nRF52832/main.c
        //case BLE_ADV_EVT_IDLE:
        //    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
        //    APP_ERROR_CHECK(err_code);
        //    sleep_mode_enter();
        //    break;

        case BLE_ADV_EVT_WHITELIST_REQUEST:
        {
            ble_gap_addr_t whitelist_addrs[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
            ble_gap_irk_t  whitelist_irks[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
            uint32_t       addr_cnt = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;
            uint32_t       irk_cnt  = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

            err_code = pm_whitelist_get(whitelist_addrs, &addr_cnt, whitelist_irks,  &irk_cnt);
            APP_ERROR_CHECK(err_code);
            //NRF_LOG_DEBUG("pm_whitelist_get returns %d addr in whitelist and %d irk whitelist", addr_cnt, irk_cnt);
            SEGGER_RTT_WriteString(0,"a whitelist request has been made\n");
            // Set the correct identities list (no excluding peers with no Central Address Resolution).
            identities_set(PM_PEER_ID_LIST_SKIP_NO_IRK);

            // Apply the whitelist.
            err_code = ble_advertising_whitelist_reply(&m_advertising,whitelist_addrs,addr_cnt,whitelist_irks,irk_cnt);
            APP_ERROR_CHECK(err_code);
        }
        break;

        case BLE_ADV_EVT_PEER_ADDR_REQUEST:
        {
            pm_peer_data_bonding_t peer_bonding_data;
            SEGGER_RTT_WriteString(0,"a peer address request has been made\n");
            // Only Give peer address if we have a handle to the bonded peer.
            if (m_peer_id != PM_PEER_ID_INVALID)
            {
                err_code = pm_peer_data_bonding_load(m_peer_id, &peer_bonding_data);
                if (err_code != NRF_ERROR_NOT_FOUND)
                {
                    APP_ERROR_CHECK(err_code);

                    // Manipulate identities to exclude peers with no Central Address Resolution.
                    identities_set(PM_PEER_ID_LIST_SKIP_ALL);

                    ble_gap_addr_t * p_peer_addr = &(peer_bonding_data.peer_ble_id.id_addr_info);
                    err_code = ble_advertising_peer_addr_reply(&m_advertising, p_peer_addr);
                    APP_ERROR_CHECK(err_code);
                }

            }
            break;
        }

        default:
            break;
    }
}



/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            //SEGGER_RTT_WriteString(0,"Connected");
            SEGGER_RTT_WriteString(0, "Connected.\n");

            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;

            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_ERROR_CHECK(err_code);

            if(pm_paired == 0) {
              pm_conn_secure(m_conn_handle,false);
              pm_paired++;
            }
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            //SEGGER_RTT_WriteString(0,"Disconnected");
            SEGGER_RTT_WriteString(0, "Disconnected\n");
            // LED indication will be changed when advertising starts.

            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            //NRF_LOG_DEBUG("PHY update request.");
            SEGGER_RTT_WriteString(0, "PHY update request\n");
            ble_gap_phys_t const phys =
            {
              .rx_phys = BLE_GAP_PHY_AUTO,
              .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;


        case BLE_GATTC_EVT_TIMEOUT:
            SEGGER_RTT_WriteString(0, "GATT Client Timeout.\n");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            SEGGER_RTT_WriteString(0, "GATT Server Timeout.\n");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;
        case BLE_GATTS_EVT_WRITE:
            SEGGER_RTT_WriteString(0, "GATT Write Event\n");
            break;
        case BLE_GAP_EVT_ADV_REPORT:
            SEGGER_RTT_printf(0,"RSSI: %d", p_ble_evt->evt.gap_evt.params.adv_report.rssi);


            break;
        default:
            // No implementation needed.
            break;
    }
}



/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
static void bsp_event_handler(bsp_event_t event)
{
    uint32_t         err_code;
    switch (event)
    {
      case BSP_EVENT_KEY_0: //On Button 1 press
          //SEGGER_RTT_WriteString(0,"button 1 was pressed and sheep count is decremented\n");
          //--sheep_count;
          //for(uint16_t i=0;i<20;i++){
          //  SEGGER_RTT_printf(0,"the time elapsed is %d for sheep %d\n",elapsed_times[i],i+1);
          //}
          break;

      case BSP_EVENT_KEY_1: //On Button 2 press
          delete_bonds();
          //LEDS_INVERT(BSP_LED_1_MASK); //Changes the current state of LED_2
          SEGGER_RTT_WriteString(0,"button 2 pressed and bonds deleted\n");
      case BSP_EVENT_KEY_2: //On Button 3 press   
    
            break;
      case BSP_EVENT_KEY_3:	//On Button 4 press

      case BSP_EVENT_SLEEP:
          SEGGER_RTT_WriteString(0,"BSP_EVENT_SLEEP\n");
          sleep_mode_enter();
          break;

      case BSP_EVENT_DISCONNECT:
        SEGGER_RTT_WriteString(0,"BSP_EVENT_DISCONNECT\n");
          err_code = sd_ble_gap_disconnect(m_conn_handle,
                                           BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
          if (err_code != NRF_ERROR_INVALID_STATE)
          {
              APP_ERROR_CHECK(err_code);
          }
          break;

      case BSP_EVENT_WHITELIST_OFF:
          SEGGER_RTT_WriteString(0,"BSP_EVENT_WHITELIST_OFF\n");
          delete_bonds();
          //if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
          //{
          //    err_code = ble_advertising_restart_without_whitelist(&m_advertising);
          //    if (err_code != NRF_ERROR_INVALID_STATE)
          //    {
          //        APP_ERROR_CHECK(err_code);
          //    }
          //}
          break;
      default:
          break;
    }
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create repeated event timer
    err_code = app_timer_create(&m_our_char_timer_id, APP_TIMER_MODE_REPEATED, tap_notification_timeout_handler);  //temp timer
    APP_ERROR_CHECK(err_code);

    // Create battery timer.
    err_code = app_timer_create(&m_battery_timer_id, APP_TIMER_MODE_REPEATED, battery_level_meas_timeout_handler);
    APP_ERROR_CHECK(err_code);

    // Create battery timer.
    err_code = app_timer_create(&m_battery_frequency_id, APP_TIMER_MODE_SINGLE_SHOT, notifyOfFrequencyChange);
    APP_ERROR_CHECK(err_code);
}

